# Accediendo a Bases de Datos con Python

## 1. Python SQL DB-APIs

In [162]:
import pandas as pd
tabla=pd.DataFrame({'Aplicación o Base de datos':['MySLQ','PostgreSQL','IBM DB2','SQL Server','Database MS Access','Oracle','Java','MongoDB'],'SQL API':['MySQL Connector API','psycopg2','ibm_db','dblin API','ODBC','OCI','JDBC','PyMongo']})
tabla

  Aplicación o Base de datos              SQL API
0                      MySLQ  MySQL Connector API
1                 PostgreSQL             psycopg2
2                    IBM DB2               ibm_db
3                 SQL Server            dblin API
4         Database MS Access                 ODBC
5                     Oracle                  OCI
6                       Java                 JDBC
7                    MongoDB              PyMongo

## 2. Escribiendo Código Usando DB-APIs

El código en Python se conecta con la base de datos mediante llamadas de la API.
* Las DB-APIs permiten trabajar con múltiples tipos de bases de datos relacionales.
* Una vez aprendes funciones de las DB-APIs, puedes usarlas en cualquier base de datos.

Beneficios de usar DB-APIs:
* Faciles de implementar y entender.
* Portable a través de bases de datos.
* Amplio alcance de conectividad de bases de datos desde Python.

### 2.1. Conceptos de una DB-API

Existen dos tipos de objetos en las DB-APIs

#### 2.1.1. Objetos de conexión:
* Conexiones a la base de datos.
* Administar transacciones.

#### 2.1.2. Objetos Cursores:
* Queries.
* Desplazamiento a través del conjunto resultado.
* Rescatar resultados.

#### Metodos de Conexión

* .cursor(): Retorna un nuevo objeto cursor usando la conexión.
* .commit(): Comete cualquier transacción pendiente.
* .rollback(): Proboca que la base de datos vuelva al inicio de cualquier transacción pendiente.
* .close(): Para cerrar una conexión.

#### Metodos cursores

Estos objetos representan un cursor de base de datos que son usados para administrar el contenido de una operación de recuperación.
Cualquier cambio hecho en la base de datos por cursorres inmediatamente es visible por otros cursores.
Un cursor de base de datos es una estructura de control que permite la transversalidad sobre registros en una base de datos. Se comporta como un nombre de archivo en un lenguaje de programción. Apenas un programa abre un archivo para acceder a su contenido, abre un cursor para acceder a los resultados de la query.

* .callproc()
* .execute()
* .fetchone()
* .fetchmany()
* .fetcall()
* .nextset()
* .arraysize()
* .close()

A continuación se usa la API sqlite3 para conectar con la base de datos y ejecutar queries:

El primer paso es importar las librerias que utilizaremos, luego se realiza la conexión la base de datos.

In [172]:
import sqlite3
import pandas as pd
conn=sqlite3.connect('INSTRUCTOR.db',timeout=10)

Se crea el objeto cursor con la conexión realizada anteriormente.

In [174]:
cursor_obj=conn.cursor()

Se crea una tabla mediante la ejecución de una query SQL.

In [176]:
table='''CREATE TABLE IF NOT EXISTS INSTRUCTOR(ID INT PRIMARY KEY NOT NULL,FNAME VARCHAR(20),LNAME VARCHAR(20),CITY VARCHAR (20),CCODE CHAR(2));'''
cursor_obj.execute(table)

Se insertan valores dentro de la tabla con una query SQL.

In [178]:
insert='''INSERT INTO INSTRUCTOR VALUES(1,'Rav','Ahuja','TORONTO','CA');'''
cursor_obj.execute(insert)

In [179]:
insert2='''INSERT INTO INSTRUCTOR VALUES(2,'Raul','Chong','Markham','CA'),(3,'Hima','Vasudevan','Chicago','US');'''
cursor_obj.execute(insert2)

Se muestran los datos contenidos en la tabla.

In [181]:
statement='''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)
print('Todos los datos')
output_all=cursor_obj.fetchall()
for row_all in output_all:
    print(row_all)

Todos los datos
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

Se crea un dataframe de pandas a partir de la lectura de una query SQL.

In [183]:
instructor_df=pd.read_sql_query('''SELECT * FROM INSTRUCTOR''',conn)
instructor_df

   ID FNAME      LNAME     CITY CCODE
0   1   Rav      Ahuja  TORONTO    CA
1   2  Raul      Chong  Markham    CA
2   3  Hima  Vasudevan  Chicago    US

Se realizan operaciones con pandas.

In [185]:
instructor_df.LNAME

0        Ahuja
1        Chong
2    Vasudevan
Name: LNAME, dtype: object

In [186]:
instructor_df[['FNAME']]

  FNAME
0   Rav
1  Raul
2  Hima

In [187]:
instructor_df.shape

(3, 5)

In [188]:
instructor_df['LNAME']

0        Ahuja
1        Chong
2    Vasudevan
Name: LNAME, dtype: object

In [189]:
instructor_df.iloc[1,2]

'Chong'

In [190]:
instructor_df.loc[1,'LNAME']

'Chong'

In [191]:
conn.close()